test/perf-test/benchmark_logs_20250624_1008/log_20250624_1008_input256_output256_batch8.log
[2025-06-24 21:44:29] Running input_len=256, output_len=256, batch_size=8...
INFO 06-24 21:44:34 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 06-24 21:44:36 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=8, model='deepseek', tokenizer='/home/models/DeepSeek-R1-32B/', use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/llm-infer/test/perf-test/benchmark_logs_20250624_1008/result_20250624_1008_input256_output256_batch8.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=256, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 200/200 [07:36<00:00,  2.28s/it]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  456.52    
Total input tokens:                      51000     
Total generated tokens:                  51200     
Request throughput (req/s):              0.44      
Output token throughput (tok/s):         112.15    
Total Token throughput (tok/s):          223.87    
---------------Time to First Token----------------
Mean TTFT (ms):                          894.11    
Median TTFT (ms):                        894.91    
P99 TTFT (ms):                           903.69    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.10     
Median TPOT (ms):                        68.09     
P99 TPOT (ms):                           68.50     
---------------Inter-token Latency----------------
Mean ITL (ms):                           68.10     
Median ITL (ms):                         68.10     
P99 ITL (ms):                            74.20     
==================================================
[2025-06-24 21:52:29] SUCCESS input_len=256 output_len=256 batch_size=8
---